tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "awscli"
brew "axel"
brew "bash"
brew "bash-completion@2"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "findutils"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grc"
brew "grep"
brew "jq"
brew "lnav"
brew "make"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "protobuf"
brew "python@3.9"
brew "ruby"
brew "svn"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

cask "adobe-acrobat-reader"
cask "appcleaner"
cask "docker"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-inconsolata"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "fork"
cask "google-chrome"
cask "google-drive-file-stream"
cask "iterm2"
cask "keka"
cask "mpv"
cask "notion"
cask "qlmarkdown"
cask "quicklook-json"
cask "postman"
cask "recordit"
cask "slack"
cask "tableplus"
cask "tomighty"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "zoom"
