tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "isen-ng/dotnet-sdk-versions"

cask_args appdir: "/Applications"

brew "ag"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bufbuild/buf/buf"
brew "curl"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gping"
brew "graphviz"
brew "htop"
brew "ipcalc"
brew "jq"
brew "k6"
brew "lnav"
brew "make"
brew "node"
brew "neovim"
brew "okta-aws-cli"
brew "openssh"
brew "openssl"
brew "procs"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "terraform"
brew "tldr"
brew "xh"
brew "yarn"

cask "adobe-acrobat-reader"
cask "appcleaner"
cask "authy"
cask "cyberduck"
cask "docker"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-source-code-pro"
cask "fork"
cask "iterm2"
cask "keka"
cask "logseq"
cask "mpv"
cask "microsoft-remote-desktop"
cask "mysqlworkbench"
cask "notion"
cask "obsidian"
cask "pycharm-ce"
cask "postman"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "rider"
cask "shottr"
cask "tomighty"
